title: powerup_enumeration.yml 
id: 21f99b77-ab57-4a8b-bb66-890ec1bb3af2 
status: experimental  
description: NetCat Reverse Shell 
author: RNDMBinary
date: 9.27.2023
logsource:
  product: windows
  category: process_creation
detection:
  selection1:
    EventID:
      - 1
    Image|endswith:
      - 'powershell.exe'
    CommandLine|contains:
      - 'PowerUp.ps1'
      - 'Invoke-AllChecks'
  condition: selection1 
fields: 
falsepositives: 
level: high 
tags: 
  - attack.execution 
  - attack.t1059 