title: powerup_enumeration.yml 
id: 3d242a52-8e52-4c31-ab5c-38fedce38c39
status: experimental  
description: NetCat Reverse Shell 
author: RNDMBinary
date: 9.27.2023
logsource:
  product: windows
  category: process_creation
detection:
  selection1:
    EventID:
      - 1
    Image|endswith:
      - 'powershell.exe'
    CommandLine|contains:
      - 'PowerUp.ps1'
      - 'Invoke-AllChecks'
  condition: selection1 
fields: 
falsepositives: 
level: high 
tags: 
  - attack.execution 
  - attack.t1059 
