title: ransomware_file_encryption.yml 
id: 09bd9170-70f8-4fc3-8961-24b6c6bc6ff6 
status: experimental  
description: Huntme Ransomware Artifact 
author: RNDMBinary
date: 9.27.2023
logsource:
  product: windows
  category: file_event
detection:
  selection1:
    EventID:
      - 11
    TargetFilename|contains:
      - '.xlsx'
      - '.huntme'
  condition: selection1 
falsepositives: 
level: high 
tags: 
  - attack.collection 
  - attack.t1560.001
